app/controllers/plants_controller.rb

INSERT INTO "plants" ("name", "growth", "created_at", "updated_at", "water_amount", "fed_amount") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Rose"], ["growth", 4], ["created_at", "2020-08-02 01:06:16.909411"], ["updated_at", "2020-08-02 01:06:16.909411"], ["water_amount", 2], ["fed_amount", 2]]
---
  def create
    @plant = Plant.new(plant_params)

    respond_to do |format|
      if @plant.save

UPDATE "plants" SET "water_amount" = ?, "watered_at" = ?, "fed_at" = ?, "growth" = ?, "updated_at" = ? WHERE "plants"."id" = ?  [["water_amount", 1], ["watered_at", "2020-08-02 15:13:48.566002"], ["fed_at", "2020-08-02 15:13:48.566142"], ["growth", 3], ["updated_at", "2020-08-02 15:13:48.566602"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @plant.update(plant_params)

SELECT  "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_plant
      @plant = Plant.find(params[:id])